# Parameters
nc: 2  # number of classes
scales:
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752  parameters, 9458736  gradients, 21.7  GFLOPs
backbone:                                                         #image size 640*640
  # [from, repeats, module, args]             number of layer           Dimensions 
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2               (320*320)
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4               (160*160)
  - [-1, 1, C3k2, [256, False, 0.25]]            # 2-                   (160*160)
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8               (80*80)
  - [-1, 1, C3k2, [512, False, 0.25]]            # 4                    (80*80)
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16              (40*40)
  - [-1, 1, C3k2, [512, True]]                   # 6                    (40*40)
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32              (20*20)
  - [-1, 2, C3k2, [1024, True]]                  # 8                    (20*20)
  - [-1, 1, SPPF, [1024, 5]]                     # 9                    (20*20)
  - [-1, 2, C2PSA, [1024]]                       # 10                   (20*20)   
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11                   (40*40)
  - [[-1, 6], 1, Concat, [1]]                    # 12                   (40*40)
  - [-1, 1, C3k2, [512, True]]                   # 13                  (40*40)
  # -- Enhanced P2/4 Pathway --
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]   #14                   (160*160)
  - [[-1, 2], 1, Concat, [1]]                    # 15                  (160*160)
  - [-1, 1, C3k2, [256, 3, 1]]                   # 16 (P2/4-Tiny)      (160*160)
 
  - [-1, 1, Conv, [256, 3, 2]]                   # 17                   (80*80)
  - [[-1, 4], 1, Concat, [1]]                    # 18                   (80*80)
  - [-1, 1, C3k2, [256, True]]                   # 19 (P3/8-small)      (80*80)
  

  - [-1, 1, Conv, [256, 3, 2]]                   # 20                   (40*40)
  - [[-1, 13], 1, Concat, [1]]                   # 21                   (40*40)
  - [-1, 1, C3k2, [512, True]]                   # 22 (P4/16-medium)    (40*40)

  - [-1, 1, Conv, [512, 3, 2]]                   # 23                   (20*20)
  - [[-1, 10], 1, Concat, [1]]                   # 24                   (20*20)
  - [-1, 2, C3k2, [1024, True]]                  # 25  (P5/32-large)    (20*20)

  # Detection Layers
  - [[16, 19, 21, 24], 1, Detect, [nc]]

